Repository: ChrisLauinger77/gnome-shell-extension-SmartAutoMoveNG
Catalog: po/*.po
Languages: de, fr, ru, zh_cn

source: Saved Windows
de: Gespeicherte Fenster
fr: Fenêtres sauvegardées
ru: Сохраненные окна
zh_cn: 已保存的窗口

source: Cleanup Non-occupied Windows
de: Nicht besetzte Fenster aufräumen
fr: Nettoyer les fenêtres non occupées
ru: Очистка незанятых окон
zh_cn: 清除未打开的窗口

source: Settings
de: Einstellungen
fr: Paramètres
ru: Настройки
zh_cn: 设置

source: Overrides
de: Überschreibungen
fr: Remplacements
ru: Переопределить
zh_cn: 自定义规则

source: Freeze Saves
de: Speichern einfrieren
fr: Geler les sauvegardes
ru: Заморозить Сохранить
zh_cn: 暂停记录

source: Activate Workspace
de: Arbeitsbereich aktivieren
fr: Activer l'espace de travail
ru: Активировать рабочее пространство
zh_cn: 激活工作区

source: Ignore Position
de: Position ignorieren
fr: Ignorer la position
ru: Игнорировать позицию
zh_cn: 忽略位置

source: Ignore Workspace
de: Arbeitsbereich ignorieren
fr: Ignorer l'espace de travail
ru: Игнорировать рабочее пространство
zh_cn: 忽略工作区

source: Ignore Monitor
de: Monitor ignorieren
fr: Ignorer l'écran
ru: Игнорировать монитор
zh_cn: 忽略显示器

source: enabled
de: aktiviert
fr: activé
ru: включенный

source: disabled
de: deaktiviert
fr: désactivé
ru: инвалид

source: Search...
de: Suchen...
fr: Rechercher...
ru: Поиск...
zh_cn: 搜索...

source: Select
de: Auswählen
fr: Sélectionner
ru: Выбрать
zh_cn: 选择

source: Cancel
de: Abbrechen
fr: Annuler
ru: Отмена
zh_cn: 取消

source: Save
de: Speichern

source: Edit Saved Window
de: Gespeichertes Fenster bearbeiten

source: Title
de: Titel

source: Workspace:
de: Arbeitsbereich:

source: On all workspaces:
de: Immer auf der sichtbaren Arbeitsfläche

source: Width:
de: Breite:

source: Height:
de: Höhe:

source: Maximized
de: Maximiert

source: Fullscreen
de: Vollbild

source: Always on Top
de: Immer im Vordergrund

source: Preferences Saved
de: Einstellungen gespeichert

source: Save Preferences
de: Einstellungen speichern

source: Select app
de: App auswählen
fr: Sélectionner une application
ru: Приложение
zh_cn: 选择应用

source: ANY
de: Beliebig
fr: N'IMPORTE LAQUELLE
ru: ЛЮБОЙ
zh_cn: 任意

source: IGNORE
de: Ignorieren
fr: IGNORER
ru: ИГНОРИРОВАТЬ
zh_cn: 忽略

source: RESTORE
de: Wiederherstellen
fr: RESTAURER
ru: ВОССТАНОВИТЬ
zh_cn: 恢复

source: DEFAULT
de: Standard
fr: PAR DÉFAUT
ru: ПО УМОЛЧАНИЮ
zh_cn: 默认

source: Delete
de: Löschen
fr: Supprimer
ru: Удалить
zh_cn: 删除

source: OVERRIDE
de: Überschreiben
fr: REMPLACER
ru: ПЕРЕОПРЕДЕЛИТЬ
zh_cn: 自定义规则

source: OVERRIDE (ANY)
de: Überschreiben (beliebig)
fr: REMPLACER (N'IMPORTE LAQUELLE)
ru: ПЕРЕОПРЕДЕЛИТЬ (ЛЮБОЙ)
zh_cn: 自定义规则 (任意窗口)

source: Edit
de: Bearbeiten

source: Edit Window - only allowed if the window is not occupied
de: Fenster bearbeiten – nur zulässig, wenn das Fenster nicht belegt ist

source: All
de: Alle

source: Size:
de: Größe:

source: Not occupied
de: Nicht besetzt
fr: Non occupée
ru: Не занято
zh_cn: 当前未打开

source: Reset Settings
de: Einstellungen zurücksetzen
fr: Réinitialiser les paramètres
ru: Сбросить настройки
zh_cn: 重置设置

source: Reset all settings to default values
de: Alle Einstellungen auf Standardwerte zurücksetzen
fr: Réinitialiser tous les paramètres aux valeurs par défaut
zh_cn: 将所有设置重置为默认值

source: Persisted window data serialized to JSON.
de: Persistierte Fensterdaten, die in JSON serialisiert wurden.
fr: Données de fenêtre persistantes sérialisées en JSON.
ru: Сохраненные данные окна сериализованы в JSON.
zh_cn: 窗口数据将以 JSON 格式存储。

source: Write detailed logs about extension behavior.
de: Detaillierte Protokolle über das Verhalten der Erweiterung schreiben.
fr: Écrire des journaux détaillés sur le comportement des extensions.
ru: Вести подробный журналы о поведении расширения.
zh_cn: 记录扩展的详细行为日志。

source: Quick Settings
de: Schnelleinstellungen
fr: Bouton des paramètres rapides
zh_cn: 快捷菜单

source: Show toggle and menu in Quick Settings.
de: Zeige Umschalter und Menü in Schnelleinstellungen.
fr: Afficher le bouton et le menu dans les paramètres rapides.
zh_cn: 在系统快捷菜单中显示开关。

source: Usage of Quick Settings toggle
de: Verwendung des Schnelleinstellungen-Umschalters

source: Enum - 0 Freeze Saves, 1 Activate Workspace, 2 Ignore Position, 3 Ignore Workspace, 4 Ignore Monitor
de: Enum - 0 Speichern einfrieren, 1 Arbeitsbereich aktivieren, 2 Position ignorieren, 3 Arbeitsbereich ignorieren, 4 Monitor ignorieren

source: Notifications
de: Benachrichtigungen

source: Allow the extension to show OSD notifications.
de: Erlaube der Erweiterung OSD-Benachrichtigungen zu senden.
fr: Autorisez l'extension à afficher les notifications OSD.

source: Startup Delay (ms)
de: Startverzögerung (ms)
fr: Délai de démarrage (ms)
ru: Задержка запуска (мсек)
zh_cn: 启动延迟 (毫秒)

source: Period of time in milliseconds to wait between seeing a window and writing it to the in-memory store.
de: Zeitraum in Millisekunden, der zwischen dem Erkennen eines Fensters und dem Schreiben in den In-Memory-Speicher gewartet wird.
fr: Période de temps en millisecondes à attendre entre le moment où une fenêtre est visible et celui où elle est écrite dans la mémoire interne.
ru: Период времени в миллисекундах между просмотром окна и записью его в хранилище памяти.
zh_cn: 识别到新窗口后，等待多久（毫秒）再记录其信息到内存。

source: Sync Frequency (ms)
de: Synchronisationsfrequenz (ms)
fr: Fréquence de synchronisation (ms)
ru: Частота синхронизации (мсек)
zh_cn: 同步频率 (毫秒)

source: Frequency in milliseconds to synchronize changes to active windows into the in-memory store.
de: Frequenz in Millisekunden, um Änderungen an aktiven Fenstern in den In-Memory-Speicher zu synchronisieren.
fr: Fréquence en millisecondes pour synchroniser les modifications apportées aux fenêtres actives dans la mémoire interne.
ru: Частота в миллисекундах для синхронизации изменений в активных окнах в хранилище памяти.
zh_cn: 同步活动窗口变动到内存的频率（毫秒）。

source: Save Frequency (ms)
de: Speicherfrequenz (ms)
fr: Fréquence de sauvegarde (ms)
ru: Частота сохранения (мсек)
zh_cn: 保存频率 (毫秒)

source: Frequency in milliseconds to persist the in-memory store to disk.
de: Frequenz in Millisekunden, um den In-Memory-Speicher auf die Festplatte zu persistieren.
fr: Fréquence en millisecondes pour conserver la mémoire stockée sur le disque.
ru: Частота в миллисекундах для сохранения содержимого памяти на диске.
zh_cn: 将内存中的窗口信息保存到磁盘的频率（毫秒）。

source: Match Threshold
de: Übereinstimmungsschwelle
fr: Seuil de correspondance
ru: Порог соответствия
zh_cn: 匹配阈值

source: Minimum threshold for matching restored windows.
de: Mindestschwelle für die Übereinstimmung wiederhergestellter Fenster.
fr: Seuil minimum pour faire correspondre les fenêtres restaurées.
ru: Минимальный порог для сопоставления восстановленных окон.
zh_cn: 恢复窗口位置时的最低匹配相似度。

source: Sync Mode
de: Synchronisationsmodus
fr: Mode de synchronisation
ru: Режим синхронизации
zh_cn: 同步模式

source: Default mode when synchronizing windows.
de: Standardmodus beim Synchronisieren von Fenstern.
fr: Mode par défaut lors de la synchronisation des fenêtres.
ru: Режим по умолчанию при синхронизации окон.
zh_cn: 识别到新窗口时的默认处理模式。

source: Overrides for restored window data.
de: Überschreibungen für wiederhergestellte Fensterdaten.
fr: Remplacements pour les données de fenêtre restaurées.
ru: Переопределения для восстановленных данных окна.
zh_cn: 为特定窗口设定自定义规则。

source: Do not update saved window data.
de: Gespeicherte Fensterdaten nicht aktualisieren.
fr: Ne pas mettre à jour les données de fenêtre sauvegardées.
ru: Не обновлять сохраненные данные окна.
zh_cn: 暂停更新已保存的窗口信息。

source: Follow apps when they are moved to another workspace.
de: Apps folgen, wenn sie in einen anderen Arbeitsbereich verschoben werden.
fr: Suivre les applications lorsqu'elles sont déplacées vers un autre espace de travail.
ru: Отслеживайте приложения при их перемещении в другое рабочее пространство.
zh_cn: 当窗口被恢复到另一个工作区时，自动切换到该工作区。

source: Do not restore windows' position.
de: Fensterposition nicht wiederherstellen.
fr: Ne pas restaurer la position des fenêtres.
ru: Не восстанавливайте положение окон.
zh_cn: 不恢复窗口的位置。

source: Do not restore windows' workspace.
de: Arbeitsbereich der Fenster nicht wiederherstellen.
fr: Ne pas restaurer l'espace de travail des fenêtres.
ru: Не восстанавливайте окно рабочего пространства.
zh_cn: 不恢复窗口所在的工作区。

source: Do not restore windows' monitor.
de: Monitor der Fenster nicht wiederherstellen.
fr: Ne pas restaurer l'écran des fenêtres.
zh_cn: 不恢复窗口所在的显示器。

source: Edit-Dialog Workspace max value
de: Bearbeiten-Dialog Arbeitsbereich Maximalwert

source: Workspace max value in the edit-saved-windows dialog.
de: Maximalwert für den Arbeitsbereich im Dialogfeld „Gespeicherte Fenster bearbeiten“.

source: Edit-Dialog Monitor max value
de: Bearbeiten-Dialog Monitor Maximalwert

source: Monitor max value in the edit-saved-windows dialog.
de: Maximalwert im Dialogfeld „Gespeicherte Fenster bearbeiten“ überwachen.

source: Edit-Dialog Position X max value
de: Bearbeiten-Dialog Position X Maximalwert

source: Position X max value in the edit-saved-windows dialog.
de: Position X Maximalwert im Dialogfeld „Gespeicherte Fenster bearbeiten“.

source: Edit-Dialog Position Y max value
de: Bearbeiten-Dialog Position Y Maximalwert

source: Position Y max value in the edit-saved-windows dialog.
de: Maximalwert der Position Y im Dialogfeld „Gespeicherte Fenster bearbeiten“.

source: Edit-Dialog Width max value
de: Maximalwert für die Breite des Bearbeitungsdialogs

source: Width max value in the edit-saved-windows dialog.
de: Maximaler Wert für die Breite im Dialogfeld „Gespeicherte Fenster bearbeiten“.

source: Edit-Dialog Height max value
de: Maximaler Wert für die Höhe des Bearbeitungsdialogs

source: Height max value in the edit-saved-windows dialog.
de: Maximaler Wert für die Höhe im Dialogfeld „Gespeicherte Fenster bearbeiten“.

source: General
de: Allgemein
fr: Général
ru: Общий
zh_cn: 常规

source: User Interface
de: Benutzeroberfläche
fr: Interface Utilisateur

source: Quick Settings toggle
de: Schnelleinstellungen-Umschalter
fr: Bouton des paramètres rapides

source: Default Synchronization Mode
de: Standard-Synchronisationsmodus
fr: Mode de synchronisation par défaut
ru: Режим синхронизации по умолчанию
zh_cn: 默认同步模式

source: Sync Frequency (milliseconds)
de: Synchronisationsfrequenz (Millisekunden)
fr: Fréquence de synchronisation (millisecondes)
ru: Частота синхронизации (мсек)
zh_cn: 同步频率 (毫秒)

source: Save Frequency (milliseconds)
de: Speicherfrequenz (Millisekunden)
fr: Fréquence de sauvegarde (millisecondes)
ru: Частота сохранения (мсек)
zh_cn: 保存频率 (毫秒)

source: Startup Delay (milliseconds)
de: Startverzögerung (Millisekunden)
fr: Délai de démarrage (millisecondes)
ru: Задержка запуска (мсек)
zh_cn: 启动延迟 (毫秒)

source: Boundaries for Edit-dialog
de: Grenzen für Bearbeitungsdialog

source: Edit-Dialog
de: Bearbeiten-Dialog

source: Click 'Save Preferences' to apply your changes.
de: Klicken Sie auf „Einstellungen speichern“, um Ihre Änderungen zu übernehmen.

source: Boundaries
de: Grenzen

source: Max value for workspace.
de: Maximalwert für Arbeitsbereich.

source: Max value for monitor.
de: Maximalwert für Monitor.

source: Max value for X position.
de: Maximalwert für die X-Position.

source: Max value for Y position.
de: Maximalwert für die Y-Position.

source: Max value for width.
de: Maximalwert für die Breite.

source: Max value for height.
de: Maximalwert für die Höhe.

source: List of saved windows and their properties.
de: Liste der gespeicherten Fenster und ihrer Eigenschaften.

source: List of application-specific overrides.
de: Liste der anwendungsspezifischen Überschreibungen.

source: Add Application
de: Anwendung hinzufügen
fr: Ajouter une application
ru: Добавить приложение
zh_cn: 添加应用程序

source: Debug Logging
fr: Journalisation du débogage
ru: Журнал
zh_cn: 调试日志
